[
    {
      "bookId": 1,
      "bookName": "The Silent Patient",
      "author": "Alex Michaelides",
      "image": "/public/books/silent-patient.jpeg",
      "review": "The Silent Patient is an intense psychological thriller about a woman who shoots her husband and then never speaks again. This book weaves an intricate plot filled with twists, making it an engrossing read. The unraveling of the mystery surrounding Alicia's silence keeps readers hooked until the very last page.",
      "totalPages": 336,
      "rating": 4.6,
      "category": "Thriller",
      "tags": ["Suspense", "Psychological"],
      "publisher": "Celadon Books",
      "yearOfPublishing": 2019
    },
    {
      "bookId": 2,
      "bookName": "Educated",
      "author": "Tara Westover",
      "image": "/public/books/educated.jpg",
      "review": "Educated is a memoir that explores Tara Westover's upbringing in a strict and abusive household in rural Idaho. Denied formal education, she eventually escapes to learn about the world and earn a PhD from Cambridge University. This is a powerful story of determination and self-discovery.",
      "totalPages": 352,
      "rating": 4.7,
      "category": "Memoir",
      "tags": ["Inspiring", "Autobiography"],
      "publisher": "Random House",
      "yearOfPublishing": 2018
    },
    {
      "bookId": 3,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "/public/books/1984.jpg",
      "review": "1984 is a dystopian novel that presents a chilling vision of a totalitarian regime that uses surveillance, manipulation, and control to maintain power. Orwell's portrayal of a future where free thought is suppressed serves as a warning and remains relevant in today’s society.",
      "totalPages": 328,
      "rating": 4.8,
      "category": "Dystopian",
      "tags": ["Classic", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 5,
      "bookName": "Where the Crawdads Sing",
      "author": "Delia Owens",
      "image": "/public/books/cowards.jpg",
      "review": "Where the Crawdads Sing is a beautifully written novel that blends mystery, romance, and survival. Set in the marshlands of North Carolina, it tells the story of Kya, the 'Marsh Girl,' who grows up in isolation. This book explores themes of loneliness, love, and the connection between humans and nature.",
      "totalPages": 384,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Mystery", "Romance"],
      "publisher": "G.P. Putnam's Sons",
      "yearOfPublishing": 2018
    },
    {
      "bookId": 6,
      "bookName": "Atomic Habits",
      "author": "James Clear",
      "image": "/public/books/Atomic-Habits-by-James-Clear.jpg",
      "review": "Atomic Habits provides a proven framework for improving your daily habits, whether it's building good habits or breaking bad ones. James Clear combines scientific research with practical examples, making this a highly actionable book for personal development and self-improvement.",
      "totalPages": 320,
      "rating": 4.8,
      "category": "Self-Help",
      "tags": ["Productivity", "Psychology"],
      "publisher": "Avery",
      "yearOfPublishing": 2018
    },
    {
      "bookId": 7,
      "bookName": "The Midnight Library",
      "author": "Matt Haig",
      "image": "/public/books/midnight.jpg",
      "review": "The Midnight Library is a novel that explores the concept of 'what if.' It centers around Nora Seed, who is given the chance to explore different paths her life could have taken. This heartwarming story delves into choices, regrets, and the value of life, offering an uplifting message of hope and redemption.",
      "totalPages": 304,
      "rating": 4.3,
      "category": "Fantasy",
      "tags": ["Philosophical", "Fiction"],
      "publisher": "Canongate Books",
      "yearOfPublishing": 2020
    },
    {
      "bookId": 8,
      "bookName": "Sapiens: A Brief History of Humankind",
      "author": "Yuval Noah Harari",
      "image": "/public/books/sapiens.jpg",
      "review": "Sapiens is a thought-provoking exploration of the history of humanity, from the earliest days of Homo sapiens to the present. Harari presents deep insights into the biological, social, and economic factors that have shaped human civilization. It's a must-read for anyone interested in understanding our shared history.",
      "totalPages": 464,
      "rating": 4.7,
      "category": "Non-Fiction",
      "tags": ["History", "Science"],
      "publisher": "Harper",
      "yearOfPublishing": 2014
    },
    {
      "bookId": 9,
      "bookName": "The Alchemist",
      "author": "Paulo Coelho",
      "image": "/public/books/alchemist.jpg",
      "review": "The Alchemist is a magical story about following your dreams. Santiago, a young shepherd, embarks on a journey in search of treasure, only to discover that the real treasure lies within. This novel has become a modern classic, resonating with readers for its simple yet profound wisdom.",
      "totalPages": 208,
      "rating": 4.2,
      "category": "Fiction",
      "tags": ["Adventure", "Philosophical"],
      "publisher": "HarperOne",
      "yearOfPublishing": 1988
    },
    {
      "bookId": 10,
      "bookName": "The Book Thief",
      "author": "Markus Zusak",
      "image": "/public/books/markus.jpg",
      "review": "The Book Thief is set in Nazi Germany and follows the life of Liesel, a young girl who finds solace in stealing books. Narrated by Death, this beautifully crafted novel explores the power of words, friendship, and the human spirit during one of the darkest periods in history.",
      "totalPages": 552,
      "rating": 4.5,
      "category": "Historical Fiction",
      "tags": ["War", "Drama"],
      "publisher": "Knopf Books",
      "yearOfPublishing": 2005
    }
  ]
  